Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: གང་གི་ཕྱིར་འདི་ལ་བྲམ་ཟེའི་ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བསྐྱེད་པར་འདོད་པ་དང་། ཁམས་གསུམ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འདོད་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པར་འདོད་པ་དང་། སྐྱེ་དགུ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འདོད་པ་དང་།
en: For this reason, by wanting to perfect all of the qualities of a brahmin, wanting to make all beings happy, wanting to surpass all three realms, wanting to make offerings to all of the buddhas, wanting to surpass all living beings, wanting to liberate all beings from old age and death, and by giving rise to the mind set on unsurpassed and perfect awakening in this way, you will become endowed with illustrious qualities.’

source: རྒ་ཤི་ལས་ཐར་བར་བྱ་བར་འདོད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱ་བ་དེ་ལྟར་ཁྱོད་གྲགས་པ་བརྗོད་པའི་ཡོན་ཏན་དང་ལྡན་པར་འགྱུར་རོ། །
en: “The brahmin then said, ‘Respected Blessed One, until I become a blessed one, I shall give rise to the mind set on unsurpassed and perfect awakening!’

source: དེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བཅོམ་ལྡན་འདས་གཤེགས་པའི་བར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ་ཞེས་ངས་ཐོས་ནས་ངས་བྲམ་ཟེ་དེ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བོས་པ་དང་།
en: “When I heard about this, I summoned the brahmin to provide him with all the necessary provisions.

source: བྲམ་ཟེ་དེ་ཡང་ཞག་བདུན་དུ་དབེན་པར་ཞུགས་ནས་སྨོན་ལམ་གདབ་པར་བསམས་པ་དང་།
en: For seven days, that brahmin then stayed in the wilderness and contemplated the aspirations he had made.

source: ཞག་བདུན་པ་དེ་ལས་ཤིན་ཏུ་འདས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་གང་ན་བ་དེར་ཉེ་བར་ཕྱིན་ཏེ་བཅོམ་ལྡན་འདས་དེའི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་བོ། །
en: When those seven days had passed, he went before the blessed thus-gone one Lord of the Brahmā Realm and made aspirations in front of him.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ནམ་མཁའི་རང་བཞིན་ཅན་གང་བྲམ་ཟེ་ཉི་མ་ལ་དད་པ་ཅན་དུ་གྱུར་པ་ངས་བཙོན་རར་བཅུག་པ་དེ་ནི་གང་།
en: The Blessed One then asked, “Nature of Space, who was that brahmin devoted to the sun whom I threw into jail?”

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་རང་བཞིན་ཅན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ནི་བྲམ་ཟེ་ཉི་མ་ལ་དད་པ་ཅན་དུ་གྱུར་ཏེ།
en: The bodhisattva Nature of Space replied, “Blessed One, I was that brahmin devoted to the sun.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་དེའི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་བོ། །
en: I am the one who made those aspirations in front of the blessed thus-gone one Lord of the Brahmā Realm.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་སྔོན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོའི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་པར་གྱུར་པ་དེ་རྗོད་ཅིག །གསོལ་པ།
en: The Blessed One then said, “Noble son, speak those aspirations that you made in the past in the presence of the blessed thus-gone one Lord of the Brahmā Realm!”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་སངས་རྒྱས་མཆོད་པ་དང་། ཆོས་མཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་སྟན་ལས་ལྡང་བར་འདོད་པ་བདག་གི་སྨོན་ལམ་དེ་བཞིན་དུ་གྱུར་ཏོ། །
en: “Respected Blessed One, these were my aspirations when I wished to rise from my seat to worship the Buddha, to listen to the Dharma, and to serve the Saṅgha.

source: གང་གི་ཚེ་བདག་སྟན་ལས་ལངས་ནས་བདག་གི་ལུས་ལ་སའི་ཁམས་ཀྱི་རྡུལ་ཕྲ་མོ་ཤིན་ཏུ་ཕྲ་བའི་ཚད་ཇི་ཙམ་དུ་འགྱུར་བ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་རྟག་པར་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། ཕྱིན་ཅི་ལོག་བཞི་ཀུན་ནས་ལྡང་བའི་ལྟ་བ་དང་། སྲིད་པའི་ལྟ་བ་དང་། སྲིད་པ་དང་བྲལ་བའི་ལྟ་བ་དང་།
en: When I rose from my seat, I made the following aspiration: ‘May all the views of all beings as numerous as all the tiniest particles of the earth element present in my body, including the view of permanence, the view of annihilation, the views that are overwhelmed by the four errors, the view of existence, the view of freedom from existence, the view of the transitory collection, the views of the extremes, and all the other views related to grasping that are related to worldly defilements, all the views that each of those beings has formed since the beginnings of time, and all the views that all those beings have adhered to in saṃsāra since those myriads of eons—may all of them fade away!’

source: འཇིག་ཚོགས་ཀྱི་ལྟ་བ་དང་། མཐར་འཛིན་པའི་ལྟ་བ་དང་དེ་ལ་སོགས་པ་དང་།
en: This was my aspiration.

source: གང་ལ་ལ་འཇིག་རྟེན་པའི་ཟག་པ་དང་བཅས་པའི་ཉེ་བར་ལེན་པའི་ལྟ་བ་རྣམས་དང་། དེ་ཙམ་གྱི་སེམས་ཅན་གཅིག་གི་སྔོན་གྱི་མཐའི་མུ་ལ་ལྟ་བ་ཐམས་ཅད་མ་ལུས་པར་མངོན་པར་འདུས་བྱས་སུ་འགྱུར་བ་དང་། དེ་ཙམ་གྱི་སེམས་ཅན་རེ་རེའི་འཁོར་བ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྐམས་པར་གྱུར་ཅིག་ཅེས་བདག་གི་སྨོན་ལམ་དེ་བཞིན་དུ་བཏབ་བོ། །སེམས་ཅན་གཅིག་གི་སེམས་དང་བསམ་པ་ལ་ཡང་དེ་ལ་སོགས་པའི་ལྟ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་བར་དུ་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: I said, ‘May all those views never arise within any of those beings’ minds or in their thoughts for as long as it takes for them to awaken to unsurpassed and perfect buddhahood!

source: ཡང་བདག་གི་དེ་ཙམ་གྱི་མཐའི་མུ་བརྩམས་པ་ནས་བླ་ན་མེད་པར་མྱ་ངན་ལས་འདའ་བའི་བར་གྱི་ཕྱིར་དེ་ལ་སོགས་པའི་ལྟ་བ་ཀུན་འཕགས་པར་གྱུར་པ་དེ་ལ་སོགས་པའི་ལྟ་བ་དེ་དག་ཀྱང་མ་ལུས་པར་སེམས་དང་བསམ་པ་ལ་མ་འཇུག་ཅིག །
en: May all those views to which I have adhered in the past, including those of the noble ones, never enter my mind or thoughts for as long as it takes for me to attain unsurpassed nirvāṇa!

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ།
en: Blessed One, when I awaken to unsurpassed and perfect buddhahood, I will clear away all the views of each of those beings!’

source: སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་དེ་ཙམ་གྱི་ལྟ་བ་མ་ལུས་པར་སེལ་བ་འདི་ནི་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Those were my aspirations, Blessed One.

source: གང་གི་ཚེ་སངས་རྒྱས་ལ་ལྟ་བ་ནས་དགེ་འདུན་ལ་བསྙེན་བཀུར་བའི་བར་གྱི་ཕྱིར་བ་དག་སྟན་ལས་ལངས་པ་དེའི་ཚེ་སེམས་འདི་ལྟར་བསྐྱེད་དེ། བདག་གི་ལུས་ཀྱི་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་གྱིས་ཆུའི་ཁམས་གཏོར་བར་འགྱུར་བ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྲོའོ། །
en: “When I stood up from my seat to gaze upon the Buddha and to serve the Saṅgha, I gave rise to these thoughts: ‘May all the karmic hindrances of all beings as numerous as all the particles of sprinkled water that are as tiny as a fraction of the point of one hair on my body be completely extinguished!

source: སྔོན་གྱི་མཐའི་མུ་ཇི་ཙམ་པ་ལ་ཕ་རོལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྒྲིབ་པ་བྱས་པར་འགྱུར་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་། དགེ་བའི་སྒྲིབ་པ་དག་འཕགས་ཤིང་འདོར་བར་མ་གྱུར་ཏོ། །
en: Throughout my entire past, I have promoted the hindrances to the six perfections, karmic hindrances, hindrances related to beings, and hindrances related to virtue, and I have not relinquished them.

source: ཕྱི་མའི་མཐའི་མུ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཕ་རོལ་གྱི་སྒྲིབ་པར་བྱེད་པ་མ་ལུས་པར་འཕང་བར་འགྱུར་རོ། །
en: In the future, I will cast aside everything that creates hindrances related to the perfections for as long as it takes to pass into complete nirvāṇa.

source: གང་ཡང་བདག་གི་སྔོན་གྱི་མཐའི་མུ་ལ་སྤྱད་པས་ཕ་རོལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྒྲིབ་པར་བྱས་པར་འགྱུར་ཞིང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཀྱི་སྒྲིབ་པ་དང་།
en: Due to my past conduct, I have created hindrances related to the six perfections, and hindrances related to the Dharma, mental hindrances, and hindrances to virtue.

source: དགེ་བའི་སྒྲིབ་པར་འགྱུར་བ་དག་ཕྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པའི་རྒྱུས་སྤང་བ་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་དེ་དག་ཐམས་ཅད་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྲོའོ། །
en: In the future, in order to ripen all beings, from the moment of my renunciation until I pass into complete nirvāṇa, all of those hindrances will disappear.

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་དེ་སྙེད་ཀྱི་རྣམ་པ་དེ་ལྟ་བུའི་སྒྲིབ་པའི་ཆོས་མ་ལུས་པར་འཕང་བར་བྱ་ཞིང་སེམས་ཅན་རེ་རེ་ལ་ཡང་མྱུར་དུ་དེ་དེ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་གྱི་གཟུངས་བཀོད་པར་བྱའོ། །
en: When I awaken to unsurpassed and perfect buddhahood, I will cast off teachings related to all those types of hindrances, which are as numerous as all beings, and I will swiftly establish each and every being in just as many absorptions and dhāraṇīs!

source: སེམས་ཅན་ཐམས་ཅད་མངལ་གྱི་གནས་ལས་ཡོངས་སུ་གྲོལ་བར་བྱའོ། །
en: I will liberate all beings from rebirths, and I will free them all from the ocean of old age and death!’

source: སེམས་ཅན་ཐམས་ཅད་རྒ་ཤི་འབྱུང་བའི་རྒྱ་མཚོ་ལས་བསྒྲལ་བར་བྱའོ་ཞེས་གང་གི་ཚེ་བདག་དགེ་འདུན་ལ་བསྙེན་བཀུར་བའི་བར་གྱི་ཕྱིར་སྟན་ལས་ལྡང་བར་བྱ་བ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those are the aspirations I made when I stood up from my seat to serve the Saṅgha.

source: གང་གི་ཚེ་བདག་སྟན་གྱི་ལོངས་སྤྱོད་དང་བདེ་བའི་ཡོ་བྱད་སྤངས་ཏེ། བདག་གི་ལུས་ཀྱི་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་དུ་མེའི་ཁམས་གྱུར་པ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་སྔོན་གྱི་མཐའི་མུ་ནས་ད་ལྟར་གྱི་སྐྱེ་བའི་བར་དུ་གཞན་ལ་ལས་ཀྱིས་མ་ལུས་པར་མངོན་པར་འདུས་བྱས་པར་འགྱུར་རོ། །
en: “When I abandoned my possessions and the comfort of my seat, I made these aspirations: ‘From beginningless time until each being’s present birth, beings as numerous as all the fire particles that are as tiny as a fraction of the point of one hair on my body have all accumulated karma in relation to others.

source: གང་གི་ཚེ་ཕྱི་མའི་མཐའི་མུ་ནས་བླ་ན་མེད་པ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་འཕངས་ཤིང་སེམས་ཅན་རེ་རེའི་དེ་ཙམ་གྱི་ངན་སོང་གི་ལས་མ་ལུས་པར་སྒྲུབ་པར་འགྱུར་བ་ནས་བླ་ན་མེད་པར་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་བྲལ་བ་མེད་པར་འགྱུར་རོ། །
en: In the future, I will relinquish it for as long as it takes to attain unsurpassed nirvāṇa, and from the moment that all of the karma that leads each being to lower rebirth is used up to when I attain unsurpassed nirvāṇa I shall not be separated from them.

source: འཕགས་པའི་གདན་འདི་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་གདན་གྱི་བར་དུ་བྲལ་བ་མེད་པར་འགྱུར་རོ། །
en: From the moment I reach the level of a noble one until I reach the seat of awakening, I shall not be separated from them.

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ལ་རྣམ་པ་དེ་ལྟ་བུའི་ལས་བསྒྲུབས་པ་མངོན་པར་འདུས་བྱས་པར་འགྱུར་རོ། །
en: I have also completed and accumulated such karma in the past.

source: གང་ཡང་མངོན་པར་འདུ་བྱེད་པ་ནས་བླ་ན་མེད་པར་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །
en: From the moment this karma is fully formed until I pass into unsurpassed nirvāṇa, all forms of birth will gradually be extinguished.

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་སེམས་ཅན་སྤྱོད་ཡུལ་ངན་པ་དང་། དམའ་བའི་ངན་འགྲོར་གནས་པ་དག་ཡོངས་སུ་ཐར་བར་བྱ་བ་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་དགོད་པར་བྱ་བའི་བར་དུ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: When I have awakened to unsurpassed and perfect awakening, I will do everything from liberating beings from the evil domains and the lower realms up to establishing them in the six perfections!’

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་ལ་ལྟ་བ་ནས་དགེ་འདུན་ལ་བསྙེན་བཀུར་བའི་ཕྱིར་སྟན་ལས་ལངས་ཏེ་སྨོན་ལམ་འདི་ལྟ་བུ་བྱས་ཏེ།
en: Respected Blessed One, those were my aspirations.

source: རླུང་གི་ཁམས་བདག་གི་ལུས་ཀྱི་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཙམ་དུ་འགྱུར་བ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེའི་དེ་ཙམ་གྱི་སྔོན་གྱི་མཐའི་མུའི་བར་དུ་གཞན་ལ་ཁམས་མཚུངས་པ་མེད་པའི་འཁྲུག་པར་བྱེད་པའི་ལས་དེ་དག་ཐམས་ཅད་མ་ལུས་པར་འདུས་བྱས་པར་འགྱུར་རོ། །
en: “When I rose from my seat to gaze upon the Buddha and to serve the Saṅgha, I made these aspirations: “Since the beginning of time, all beings as numerous as all the particles of air that are as tiny as a fraction of the point of one hair on my body have accumulated all kinds of karma related to acting on an incomparably violent impulse toward others.

source: ཡང་འཁོར་བ་ན་འཁོར་བ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཁམས་འཁྲུག་པའི་ནད་དུ་མ་གྱུར་ཅིག །
en: From one life to the next and for as long as it takes for them to pass into unsurpassed, complete nirvāṇa, may those beings never suffer from the illness of a violent disposition!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བརྩམས་ཏེ་གཞན་ལ་ཁམས་འཁྲུག་པར་བྱེད་པའི་ལས་མ་ལུས་པར་མངོན་པར་འདུ་བྱ་བར་འགྱུར་བ་ནས་བླ་ན་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་འཕང་བར་བྱའོ། །
en: From the moment that I accumulated all of the karma related to acting on a violent disposition toward others in the past, for as long as it takes to pass into unsurpassed, complete nirvāṇa, I will relinquish this karma.

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་ཇི་ཙམ་གྱི་ཏིང་ངེ་འཛིན་སྒྲུབ་པའི་ཚུལ་གྱིས་ཁམས་འཁྲུག་པ་མ་ལུས་པར་སེལ་བར་བྱའོ། །
en: When I awaken to unsurpassed and perfect buddhahood, I will clear away all the violent dispositions of each and every being by accomplishing just as many absorptions.

source: སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་བརྩོན་འགྲུས་ལ་དམིགས་པ་ཐབས་ལ་མཁས་པའི་ཡེ་ཤེས་བསླབ་པར་བྱ་ཞིང་དེ་ཙམ་གྱི་ཆོས་ཀྱི་སྒོ་སྟོང་ཡང་རབ་ཏུ་བསྟན་པར་བྱའོ།
en: I will train each of those beings in the wisdom of skillful means, which is supported by diligence, and I will teach them a thousand gateways to the Dharma.

source: དེ་ཙམ་གྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བར་བྱ་བ་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་སྦྱོར་བར་བྱའོ། །
en: I will do everything from making them practice the perfection of generosity up to making them practice the perfection of insight, and I will establish them at the level of nonregression.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་དགོད་པར་བྱའོ། །
en: I will encourage and instruct all those beings as numerous as all those blessed buddhas!’

source: དེ་ཙམ་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སེམས་ཅན་རེ་རེ་ལ་ཡང་བཅོལ་ཞིང་གདམས་པར་བྱ་བ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་ལ་བལྟ་བ་ནས་དེ་བཞིན་དུ་སྨོན་ལམ་བྱས་པའི་བར་དུ་རྐང་ལག་གཉིས་ས་ལ་གཞག་པར་བྱའོ། །གང་གི་ཚེ་བདག་ནམ་མཁའི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་ཉོན་མོངས་པས་བཅིངས་པའི་བག་ལ་ཉལ་བ་ཐམས་ཅད་ཀྱིས་ཉོན་མོངས་པ་མེད་པ་ཇི་ཙམ་པ་ལ་ནམ་མཁའ་ལ་ཆགས་པ་མེད་པར་འགྲོ་བ་ན་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་ཉོན་མོངས་པས་བཅིངས་པའི་བག་ལ་ཉལ་བ་གྲངས་མེད་པ་བརྗོད་དུ་མེད་པ་མ་ལུས་པར་གྱུར་ཅིག །
en: “When I rose from my seat to gaze upon the Buddha, and made those aspirations, I placed both my hands and feet on the ground and made these aspirations: “When I course through space without attachment for as long as I am not afflicted by all manner of latent tendencies, due to which one is bound by afflictions as boundless and infinite as the space element, may all of the inexpressible, innumerable latent tendencies, due to which each and every being is bound by the afflictions, be extinguished!

source: དེ་ཙམ་གྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ནམ་མཁའི་རང་བཞིན་ལྟ་བུ་ལ་ཞུགས་པ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཉོན་མོངས་པ་ཐམས་ཅད་དང་འདྲེས་པ་མེད་པར་གྱུར་ཅིག །
en: May they understand the space-like nature of all phenomena, and may they not be contaminated by any afflictions for as long as it takes for them to pass into unsurpassed, complete nirvāṇa.

source: ཆོས་ཐམས་ཅད་མ་དྲན་པ་མེད་པར་འགྱུར་བ་ནས་ནམ་མཁའི་ཁམས་མཐའ་ཡས་མུ་མེད་པའི་ཉོན་མོངས་པས་བཅིངས་པའི་བག་ལ་ཉལ་བས་ཉོན་མོངས་པ་མེད་པའི་བར་དུ་དེ་ཙམ་གྱི་ཉོན་མོངས་པས་བཅིངས་པའི་བག་ལ་ཉལ་བ་ཐམས་ཅད་མ་ལུས་པར་དག་པར་གྱུར་ཅིག །
en: May they accomplish everything from not lacking recollection of all phenomena to not being afflicted by the latent tendencies that cause one to be bound by afflictions as boundless and infinite as space, and may all those latent tendencies that cause one to be bound by afflictions be purified!

source: དེ་ཙམ་གྱི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ནམ་མཁའི་རང་བཞིན་ལྟ་བུ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་འཇུག་པར་བྱའོ། །
en: I will instill in them everything from understanding the space-like nature of all phenomena to passing into unsurpassed, complete nirvāṇa!

source: བདག་ནི་ནམ་མཁའ་ལ་ཀུན་ཏུ་རྟོག་པས་འཁོར་བ་ན་བདག་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་པར་བྱའོ། །
en: By thinking things are like space, I will practice the conduct of awakening so that I can attain unsurpassed wisdom in saṃsāra.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་རྙོག་པ་སྦྱང་བར་བྱ་བ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་བར་དུ།
en: I will do everything from purifying the afflicted defilements of all beings to causing them to awaken to unsurpassed and perfect buddhahood.

source: སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་དགེ་བའི་ཆོས་མཐའ་ཡས་མུ་མེད་པ་བསྟན་པར་བྱའོ། །
en: I will teach each and every being boundless, limitless virtuous teachings.

source: ནམ་མཁའི་རང་བཞིན་ལྟ་བུའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བསླབ་པར་བྱ་ཞིང་དགོད་པར་བྱ་བ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་སེམས་ཅན་དེ་དག་ཆོས་ཀྱི་སྒོ་ནམ་མཁའི་རང་བཞིན་ཅན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དེ་དག་ཏུ་དྲན་པ་ཉམས་པར་མ་གྱུར་པ་འདི་ནི།
en: I will train and establish them in the six perfections that have the same nature as space. For as long as it takes until they pass into unsurpassed, complete nirvāṇa, may those beings’ recollection of the myriads of gateways to the Dharma, which are related to the perfections that have the nature of space, never decline!’

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་བལྟ་བ་དང་། ཆོས་མཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བའི་ཕྱིར་ཉེ་བར་འགྲོ་བ་ཡང་དེ་བཞིན་དུ་སྨོན་ལམ་བཏབ་སྟེ་སྤྱད་པ་ན་བདག་གི་རྐང་པ་གཉིས་ཀྱི་མཐིལ་ས་ལ་རེག་པ་ཇི་ཙམ་པ་དང་། གླིང་བཞི་པའི་ས་ནས་བཟུང་སྟེ། བླ་ན་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བར་འགྱུར་བ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་ཕྱི་མའི་མཐའི་མུ་ནས་བཟུང་སྟེ། ཕ་རོལ་གྱི་གནན་ཡན་ལག་མ་ཚང་བ་འདོད་པ་མེད་པར་འགྱུར་བ་ཡོད་ཅིང་ལས་ཀྱི་སྒྲིབ་པས་འཕངས་པར་འགྱུར་བ་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་ལས་དེ་དག་མ་ལུས་པར་འགྱུར་ཞིང་།
en: “When I approached to gaze upon Buddha, listen to the Dharma, and serve the Saṅgha, I made these aspirations: ‘In the future may each and every one of the beings, as numerous as all the tiniest particles of dust that the soles of my feet touch while walking and all the tiniest particles of dust in this four-continent world, who do not want to have a deformed body in the next life and have been cast aside because of that karmic hindrance, completely exhaust that karma!

source: འཁོར་བ་ན་འཁོར་བ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཡན་ལག་མ་ཚང་བ་མེད་པར་གྱུར་ཅིག །
en: From one life to the next, for as long as it takes them to pass into unsurpassed, complete nirvāṇa, may they never be reborn with a deformed body!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། ཕ་རོལ་གྱི་གན་དུ་ཡན་ལག་མ་ཚང་བའི་ལས་ཀྱི་སྒྲིབ་པ་ཇི་ཙམ་པ་དེ་ཙམ་འཕངས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་གྱུར་ཅིག །
en: May I cast off all of the karmic hindrances from the past related to having a deformed body in the next life and may all of them be completely extinguished!

source: བདག་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཆེན་པོ་ཐོབ་པའི་རྒྱུར་བྱས་ཏེ་སྟོབས་ལྔའི་ཡན་ལག་དང་བྲལ་བ་མེད་པར་འགྱུར་རོ། །
en: Since I have created the cause to attain unsurpassed great wisdom, I will not part from the five limbs of power.

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོངས་སུ་བཀང་བར་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པར་བྱའོ། །
en: When I awaken to unsurpassed and perfect buddhahood, I will teach the method of absorption to all beings so that I may completely fill them with the powers, strengths, and factors of awakening.

source: སེམས་ཅན་ཐམས་ཅད་ཐེག་པ་གསུམ་ལ་ལུང་སྟོན་ཅིང་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་ཡང་དགོད་པར་བྱ་བ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: I will teach the three vehicles to all beings, and I will establish them at the level of nonregression!’ Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་མཐོང་ཞིང་ཆོས་སྨྲ་བ་དང་དགེ་སློང་གི་དགེ་འདུན་མཐོང་ནས་ཀྱང་དེ་བཞིན་དུ་སྨོན་ལམ་བཏབ་བོ། །དེ་འགྲོ་བ་ལྔ་དང་། གནས་གསུམ་དང་། སྐྱེ་གནས་བཞི་ལ་རྣམ་པར་ཤེས་པའི་ཁམས་སུ་འགྱུར་བ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། གཞན་ལ་དབང་པོ་དྲུག་མ་ཚང་བའི་ལས་ཐམས་ཅད་མ་ལུས་པར་འཕངས་པར་གྱུར་ཅིག །
en: “After I saw the Buddha and saw the Dharma reciters and the Saṅgha of monks, I made these aspirations: ‘May all of the actions toward others that are related to the six sense faculties being impaired be completely cast off by each and every one of the beings, as numerous as the elements of consciousness in the five destinies, three abodes, and four modes of rebirth, who have accumulated such actions in the past!

source: ཕྱི་མའི་མཐའི་མུ་འཕང་བ་ནས་མཆོག་ཏུ་རྒྱ་ཆེ་བ་དགའ་བར་བྱེད་པའི་དབང་པོ་དྲུག་ཡོངས་སུ་རྫོགས་པ་ཐོབ་པར་གྱུར་པ་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་དབང་པོ་དྲུག་མཚང་བ་མེད་པར་གྱུར་ཅིག །
en: In the future, after they have been cast off, may the sense faculties of those who have obtained the most far-reaching, delightful, and perfect sense faculties remain intact for as long as it takes for them to pass into unsurpassed, complete nirvāṇa!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། གཞན་ལ་དབང་པོ་ཉམས་པའི་ལས་མངོན་པར་འདུས་བྱས་པ་འཕངས་པར་འགྱུར་བ་མ་ལུས་པར་འདོར་བ་མེད་པར་གྱུར་ཅིག །
en: May all the actions toward others related to diminished faculties that I have accumulated in the past be cast off, be completely discarded, and be negated!

source: སེམས་ཅན་རྣམས་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཆེན་པོ་ཐོབ་པའི་བར་གྱི་ཕྱིར་མཆོག་ཏུ་རྒྱ་ཆེ་བ་བལྟ་ན་སྡུག་པ་དགའ་བར་བྱེད་པའི་དབང་པོ་དྲུག་ཡོངས་སུ་ཚང་བས་བྲལ་བ་མེད་པར་གྱུར་ཅིག །
en: In order to make beings attain unsurpassed great wisdom, may I never part from the most far-reaching, attractive, delightful, and complete sense faculties!

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ།
en: When I awaken to unsurpassed and perfect buddhahood, I will then crush all the karmic hindrances of every being into dust!’

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པར་ཐལ་བར་བྱས་པ་འདི་ནི་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །གང་གི་ཚེ་བདག་སངས་རྒྱས་དང་། ཆོས་སྨྲ་བ་དང་།
en: Respected Blessed One, those were my aspirations.

source: དགེ་འདུན་གྱི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་འདི་ལྟར་སེམས་བསྐྱེད་པར་བྱའོ། །བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་གྱིས་སོང་བར་གྱུར་པ་ཇི་ཙམ་པ་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་བ་ནས། བདག་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བཟུང་སྟེ།
en: “When I knelt on my right knee before the Buddha, the Dharma reciters, and the Saṅgha of monks, I gave rise to these thoughts: ‘May all the beings as numerous as all the shortest instants that I have lived through in the past never experience the karmic ripening of the path of the ten nonvirtuous actions they and I have followed in the past!

source: རྣམ་པར་མ་སྨིན་པར་འཇུག་ཅིང་འདོར་བ་མེད་པར་བྱས་པའི་བར་དུ་མ་ལུས་པར་རྣམ་པར་མ་སྨིན་པར་གྱུར་ཅིག །
en: May all those actions not be made to ripen and not ripen for as long as it takes for them to be discarded and no longer exist!

source: ཡང་སེམས་ཅན་རེ་རེ་ལ་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྫོགས་པར་བྱ་བའི་ཕྱིར། དེ་ཙམ་གྱི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་འདུ་བྱེད་རྣམས་དགེ་བ་ལ་མངོན་པར་འདུས་བྱས་སུ་གྱུར་ཅིག །
en: In order for all those beings to master the six perfections, may all their physical, verbal, and mental formations accumulate virtue!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རྣམ་པར་སྨིན་པར་འཇུག་ཅིང་འདོར་བ་མེད་པར་འགྱུར་བ་མ་ལུས་པར་རྣམ་པར་སྨིན་པར་གྱུར་ཅིག །
en: May the path of the ten virtuous actions that I have carried out in the past be made to ripen and may those that have not been discarded fully ripen!

source: བདག་ནི་རྟག་ཏུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱིས་འབྲལ་བ་མེད་པར་འགྱུར་བ་ནས།
en: May I never part from the path of the ten virtuous actions!

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་བར་དུ་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་དགེ་བ་དང་མི་དགེ་བའི་འདུས་བྱས་ཀྱི་ཆོས་རབ་ཏུ་བསྟན་ཅིང་།
en: For as long as it takes for me to awaken to unsurpassed and perfect buddhahood, I will teach the Dharma related to accumulating virtue and nonvirtue to all those beings, and I will instruct them through the three vehicles!’
